In [1]:
import pandas as pd

In [9]:
x=pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10]],index=[1,2],columns=['a','b','c','d','e'])

In [10]:
x

   a  b  c  d   e
1  1  2  3  4   5
2  6  7  8  9  10

In [21]:
x.head(1)

   a  b  c  d  e
1  1  2  3  4  5

In [16]:
x.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 1 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      int64
 1   b       2 non-null      int64
 2   c       2 non-null      int64
 3   d       2 non-null      int64
 4   e       2 non-null      int64
dtypes: int64(5)
memory usage: 96.0 bytes

In [17]:
x.describe()

              a         b         c         d          e
count  2.000000  2.000000  2.000000  2.000000   2.000000
mean   3.500000  4.500000  5.500000  6.500000   7.500000
std    3.535534  3.535534  3.535534  3.535534   3.535534
min    1.000000  2.000000  3.000000  4.000000   5.000000
25%    2.250000  3.250000  4.250000  5.250000   6.250000
50%    3.500000  4.500000  5.500000  6.500000   7.500000
75%    4.750000  5.750000  6.750000  7.750000   8.750000
max    6.000000  7.000000  8.000000  9.000000  10.000000

In [20]:
x.tail(1)

   a  b  c  d   e
2  6  7  8  9  10

In [27]:
y=pd.DataFrame({'Roll No':[101,102,103,104,105],'Name':['Varad','Raj','Ajay','Karan','Aman']},index=[1,2,3,4,5])

In [28]:
y

   Roll No   Name
1      101  Varad
2      102    Raj
3      103   Ajay
4      104  Karan
5      105   Aman

In [29]:
y.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1 to 5
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Roll No  5 non-null      int64
 1   Name     5 non-null      object
dtypes: int64(1), object(1)
memory usage: 120.0+ bytes

In [30]:
y.describe()

          Roll No
count    5.000000
mean   103.000000
std      1.581139
min    101.000000
25%    102.000000
50%    103.000000
75%    104.000000
max    105.000000

In [31]:
y.head(2)

   Roll No   Name
1      101  Varad
2      102    Raj

In [32]:
y.tail(2)

   Roll No   Name
4      104  Karan
5      105   Aman

In [33]:
y.isnull()

   Roll No   Name
1    False  False
2    False  False
3    False  False
4    False  False
5    False  False

In [34]:
y.duplicated()

1    False
2    False
3    False
4    False
5    False
dtype: bool